---
kind: method
id: M:Autodesk.Revit.DB.CategoryNameMap.ReverseIterator
source: html/243317ae-9a4e-7bc2-57e1-5efddfaeaab6.htm
---
# Autodesk.Revit.DB.CategoryNameMap.ReverseIterator Method

Retrieve a backward moving iterator to the map.

## Syntax (C#)
```csharp
public virtual CategoryNameMapIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the map.